import numpy as np

a = np.array([
    -63, 152, -146, 0,
    -63, 152, -146, 0,
    -63, 152, -146, 0,
    -63, 152, -146, 0
], dtype=np.float32)

b = np.array([
    0.00230408, 0.00239563, -0.00466919, 0,
    0.00239563, 0.00294495, -0.00436401, 0,
    -0.00466919, -0.00436401, 0.0098877, 0,
    0, 0, 0, 0
], dtype=np.float32)

c = np.array([
    -63, -63, -63, -63,
    152, 152, 152, 152,
    -146, -146, -146, -146,
    0, 0, 0, 0
], dtype=np.float32)

# element-wise で掛けてから足す
result = a * b * c

print(np.sum(result))
